{
    "Classes": [
        {
            "className" : "Fighter", 
            "Description" : "The fighter is the classical non-magical combatant who uses weapons and armor to fight.",
            "mainStat" : "Strength",
            "hitDie" : "1d10 + 'HP Adjustment' per level",
            "startingWealth" : "5d4 x 10 gp to purchase starting equipment with. Can keep left over money.",
            "nameLevel" : "9th Level",
            "Weapons" : "Can use any weapon.",
            "Armor" : "Can wear any armor.",
            "THAC0Improvement" : "THAC0 Improvement/Level: 1/1",
            "Proficiencies" : {
                "Weapon":  "Starts at level 1 with 2 Weapon Proficiency Slots. Gains a Weapon Proficiency Slot every multiple of 4 levels",
                "nonWeapon" : "Starts at level 1 with 3 Nonweapon Proficiencies Slots. Gains a Non-Weapon Proficiency every multiple of 3 levels. Can chose a Nonweapon Proficiency at normal cost in the General and Warrior categories and from any other category for +1 cost."
              },
            "Abilities" : {
                "abilityOverview" : "Weapon Specialization: Invest two proficiency slots to specialize in a weapon. Three proficiency slots are required for bows.",
                "abilityInfo" : "Specialization for melee weapons confers a +1 bonus to all attacks and +2 to all damage. Specialization for ranged weapons gives point blank range. Within point blank range there is a +2 to all attack rolls. Point Blank range also allows one ranged attack be made before initiative is rolled. Specialization in a weapon also gives extra attacks sooner than non specialized weapons"
            }
        },
        {
            "className" : "Thief", 
            "Description" : "The thief is a romantic hero fired by noble purpose but a little wanting in strength of character. Such a person may truly strive for good but continually run afoul of temptation.",
            "mainStat" : "Dexterity, 9 required",
            "hitDie" : " 1d6 + 'HP Adjustment' per level",
            "startingWealth" : "2d6 x 10 gp to purchase starting equipment with. Can keep left over money.",
            "nameLevel" : "10th Level",
            "Weapons" : "Club, Dagger, Dart, Hand Crossbow, Knife, Lasso, Short Bow, Sling, Broad Sword, Long Sword, Short Sword, and Staff",
            "Armor" : "Can wear any, but metal armor worsens abilities.",
            "THAC0Improvement" : "THAC0 Improvement/Level: 1/2",
            "Proficiencies" : {
                "Weapon":  "Starts at level 1 with 2 Weapon Proficiency Slots. Gains a Weapon Proficiency Slot every multiple of 4 levels",
                "nonWeapon" : "Starts with 3 Non-Weapon Proficiencies. Gains a Non-Weapon Proficiency every multiple of 4 levels."
              },
            "Abilities" : {
                "abilityOverview" : "Thief Skills: At 1st level, thieves can distribute 60 percentile points to their thief skills. Each time a thief levels up, they gain another 30 points to distribute, with no more than 15 points being assigned to a single skill per level up.",
                "abilityInfo" : "The Thief Skills available are: Pick Pocket, Open Locks, Find/Remove Traps, Move Silently, Hide in Shadows, Detect Noise, Climb Walls, and Read Languages."
            }
        },
        {
            "className" : "Mage", 
            "Description" : "The Mage is Wizard who has no speciality in any school of magic. Mages are considered Generalist Wizards instead of a Specialist Wizard.",
            "mainStat" : "Intelligence, 9 Required",
            "hitDie" : "1d4 + HP Adjustment per level",
            "startingWealth" : "(1d4+1) * 10 gp. Can keep left over money.",
            "nameLevel" : "10th Level",
            "Weapons" : "Dagger, Staff, Darts, Knives, and Slings.",
            "Armor" : "Cannot wear armor & cast spells at the same time.",
            "THAC0Improvement" : "THAC0 Improvement/Level: 1/3",
            "Proficiencies" : {
              "Weapon":  "Starts at level 1 with 1 Weapon Proficiency Slots. Gains a Weapon Proficiency Slot every multiple of 6 levels",
              "nonWeapon" : "Starts with 4 Non-Weapon Proficiencies. Gains a Non-Weapon Proficiency every multiple of 3 levels. Can chose a Nonweapon Proficiency at normal cost in the General and Wizard categories and from any other category for +1 cost"

            },
            "Abilities" : {
                "abilityOverview" : "A Wizard has a Spellbook that contains all their learned spells. The learn spells roll can be found by looking up the Intelligence Ability Score table.",
                "abilityInfo" : "At 1st-level the spell book contains 3d4 1st-level spells. 2 of the starting spells must be read magic and detect magic. "
            }
        },
        {
            "className" : "Cleric", 
            "Description" : "The Cleric is a generic priest (of any mythos) who tends to the needs of a community. He is both protector and healer. When evil threatens, the cleric is well-suited to seek it out on its own ground and destroy it.",
            "mainStat" : "Wisdom, 9 Required",
            "hitDie" : "1d8 + HP Adjustment",
            "startingWealth" : "3d6 x 10 gp for starting equipment. Can only keep 3 gold, rest is given back to superiors",
            "nameLevel" : "10th Level",
            "Weapons" : "Only blunt, bludgeoning weapons. (Different Cleric Orders may have different rules for allowable weapons)",
            "Armor" : "Can wear any armor.",
            "THAC0Improvement" : "THAC0 Improvement/Level: 2/3",
            "Proficiencies" : {
              "Weapon":  "Starts with 2 Weapon Proficiency. Gains a Weapon Proficiency Slot every multiple of 4 levels",
              "nonWeapon" : "Starts with 4 Non-Weapon Proficiencies. Gains a Non-Weapon Proficiency every multiple of 3 levels. Can chose a Nonweapon Proficiency at normal cost in the General and Priest categories and +1 cost from any other category"
            },
            "Abilities" : {
                "abilityOverview" : "Clerics have access to a number of spheres of spells to cast. What spheres they have access is determined to what patron diety they follow or order they belong to.",
                "abilityInfo" : "Major Spheres: All, Astral, Charm, Combat, Creation, Divination, Guardian, Healing, Necromantic, Protection, Summoning, Sun. Minor Spheres: Elemental"
            }
        }
    ]
}